if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "wezterm" # a better terminal emulator
    cask "imageoptim" # a tool to optimize images
    cask "brew"
    cask "numi"
    cask "karabiner-elements"
    cask "google-drive"
    cask "tg-pro"
    cask "deepl"
    cask "languagetool"
    cask "betterdisplay"
    cask "scroll-reverser"
    cask "lm-studio"
    cask "obsidian"
    cask "pgadmin4"
    cask "alfred"
    cask "cloudflare-warp"
    cask "nordvpn"
    cask "wireshark"
    cask "cyberduck"
    cask "keepingyouawake"
    cask "postman"


    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "python" # python (latst)
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zsh" # zsh (latest)
brew "lua-language-server" # lua language server
brew "lazygit" # simple terminal UI for git commands
brew "n" # node.js manager
brew "opam" # OCaml package manager
brew "go" # Go programming language
brew "k9s" # Kubernetes CLI to manage your clusters in terminal
brew "gnu-sed" # GNU implementation of sed

